# tap "hashicorp/tap"
# tap "kudobuilder/tap"

brew "asdf"
brew "bash-completion@2"
brew "docker"
brew "docker-compose"
cask "devtoys"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
cask "git-credential-manager"
brew "gh"
brew "htop"
brew "go-task"
brew "tree"
brew "tmux" # Terminal multiplexer
brew "wget"
brew "watch"
# brew "session-manager-plugin"
# brew "lima" if OS.mac?
# brew "qemu" if OS.mac?
# brew "socket_vmnet" if OS.mac?
# brew "vde" if OS.mac?
