tap "hashicorp/tap"
tap "homebrew/bundle"

brew "asdf"
brew "act"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
cask "devtoys"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
cask "git-credential-manager"
brew "gh"
brew "gpg"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "htop"
brew "go-task"
brew "make"
brew "libyaml"
brew "tree"
brew "tmux" # Terminal multiplexer
cask "visual-studio-code"
brew "rsync"
brew "gnu-tar" 
brew "wget"
brew "watch"
# brew "session-manager-plugin"
# brew "lima" if OS.mac?
# brew "qemu" if OS.mac?
# brew "socket_vmnet" if OS.mac?
# brew "vde" if OS.mac?
