tap "hashicorp/tap"
tap "homebrew/bundle"

brew "asdf"
brew "act"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
cask "devtoys"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
cask "git-credential-manager"
brew "gh"
brew "gpg"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "htop"
brew "go-task"
brew "make"
brew "libyaml"
brew "tree"
brew "tmux" # Terminal multiplexer
cask "visual-studio-code"
brew "rsync"
brew "gnu-tar"
brew "wget"
brew "watch"
cask "visual-studio-code"
vscode "amazonwebservices.amazon-q-vscode"
vscode "artymaury.template-finder"
vscode "budparr.language-hugo-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "iliazeus.vscode-ansi"
vscode "jgclark.vscode-todo-highlight"
vscode "keesschollaart.vscode-home-assistant"
vscode "mechatroner.rainbow-csv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "n3rds-inc.image"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "rusnasonov.vscode-hugo"
vscode "samuelcolvin.jinjahtml"
vscode "savh.json5-kit"
vscode "task.vscode-task"
vscode "visualstudioexptteam.vscodeintellicode"
